---
kind: method
id: M:Autodesk.Revit.DB.ElementId.op_GreaterThan(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
source: html/b6abda7f-8185-14ca-3153-435bf75e56dd.htm
---
# Autodesk.Revit.DB.ElementId.op_GreaterThan Method

Determines whether one element id is greater than another element id.

## Syntax (C#)
```csharp
public static bool operator >(
	ElementId elementId1,
	ElementId elementId2
)
```

## Parameters
- **elementId1** (`Autodesk.Revit.DB.ElementId`) - The first ElementId.
- **elementId2** (`Autodesk.Revit.DB.ElementId`) - The second ElementId.

## Returns
True if the first element id is greater than the second element id, otherwise, false.